[
    {
      "Content": "Check out goodrx or the humalog website for discount cards. I got one and i only pay $25 for my prescription",
      "Category": "Website"
    },
    {
      "Content": "USA here. Humalog refill can be $35 with the digital coupon that can be downloaded from the Humalog website (that is how much I paid for my son's monthly refill of two vials of Humalog u-100 at CVS with the coupon for this month's refill).",
      "Category": "Website"
    },
    {
      "Content": "There are coupons available (definitely take the time to find them on the ozempic website) that will help with the copay with commercial insurance; coupons will not work with Medicare/Medicaid, Tricare, and state funded insurance.",
      "Category": "Website"
    },
    {
      "Content": "I was able to get discount onJardiance  through the Jardiance website -- check that out as well.",
      "Category": "Website"
    },
    {
      "Content": "I found a link for the actual Ozempic website that SAYS it increases risks of cancer",
      "Category": "Website"
    },
    {
      "Content": "So after a year of 8.x A1C I saw an ozempic TV commercial and he said \"sure\"!\n\nIt was this or starting insulin.",
      "Category": "TV ads"
    },
    {
      "Content": "The Januvia ad using Lovely Day by Bill Withers. I actually take Januvia too which is ironic.\n\nAd agencies need to start doing more original jingles, but considering the awful results we've been seeing (like with the BK ads), maybe just silence is better.",
      "Category": "TV ads"
    },
    {
      "Content": "I agree except for that smug ass “cause my body can make its own insulin” t2 lady in the trulicity ad. Get some real diabetes and then come back and let’s talk lady.",
      "Category": "TV ads"
    },
    {
      "Content": "I was watching football (Dolphins vs Ravens) this prior Sunday and I’m not kidding I think I saw 8-10 diabetes related ads. I was like wow I deal with this shit enough every day stay out of my football!! Lol",
      "Category": "TV ads"
    },
    {
      "Content": "Yup. Almost every YouTube pre-roll is an ozempic ad for me. And they are awful (and I don’t even need the product).\n\nEDIT: now that I think about it, most of the ads that I get served up are for jardiance — but it’s more or less the same thing.",
      "Category": "TV ads"
    },
    {
      "Content": "Let me start by saying that there will be people that answer this and say ”Ozempic cannot cause low blood sugar unless your are taking another medication for diabetes” , That is absolute nonsense, yes that’s what the ozempic brochure and information will tell you but don’t believe everything you read - it’s true, for 99% of the people that is a true statement, but for the 1% that have these occurrences it’s real.",
      "Category": "Brochure"
    },
    {
      "Content": "Meaning im insulin dependent, but with diet and exercise i can finagle my numbers that was as well. In my case its the small individual things that make a difference. Like figuring out what is definitely not good for you. Any information online or in the brochures are a general across the board type deal.",
      "Category": "Brochure"
    },
    {
      "Content": "Just got the Trulicity brochure, and it’s ridiculous how they sugarcoat everything. Barely any mention of side effects, just pages of how 'convenient' it is. Like, I need actual information, not a sales pitch.",
      "Category": "Brochure"
    },
    {
      "Content": "Anyone else find the Januvia brochure totally useless?",
      "Category": "Brochure"
    },
    {
      "Content": "Ozempic brochure is such a joke. All they do is hype up the weight loss and 'easy dosing,' but barely mention the side effects. I had to dig reddit to find anything useful",
      "Category": "Brochure"
    },
    {
      "Content": "She has been seeing a weight loss doctor who prescribed Ozempic. She told him she was unsure about taking it, because she didn't want to take it away from people who really need it. The doctor said \"you are obese and have been unsuccessfully trying to lose weight for decades. You also really need it\".",
      "Category": "Verbal communication"
    },
    {
      "Content": "I had issues with Janumet before I tried Januvia. My doctor told me I was odd for not having problems with metformin. When I was on Januvia, my blood sugars were consistent and at a reasonable level.",
      "Category": "Verbal communication"
    },
    {
      "Content": "I’m so frustrated with the way the nurse explained how to use Humalog. She rushed through it like it was no big deal, and I barely had time to ask questions.\"\nI hate when that happens! They assume we already know everything or that it's easy to figure out. But this is serious stuff, and the instructions need to be clear.",
      "Category": "Verbal communication"
    }
  ]